PROGRAM-ID.M.ENVIRONMENT DIVISION.INPUT-OUTPUT SECTION.FILE-CONTROL.SELECT I ASSIGN TO 'input.txt'.DATA DIVISION.FILE SECTION. FD I. 01 C. 05  D. 10 D1 PIC 9. 10 D2 PIC 9. 10 D3 PIC 9. 10 D4 PIC 9. 10 D5 PIC 9. 10 D6 PIC 9.
10 D7 PIC 9. 10 D8 PIC 9. 10 D9 PIC 9. 05 B PIC X. WORKING-STORAGE SECTION. 01 S PIC 9 VALUE 0. 01 M PIC 9. PROCEDURE DIVISION.OPEN INPUT I PERFORM R THRU E UNTIL S=1 CLOSE I STOP RUN.R.READ I AT END MOVE 1 TO S NOT AT END
COMPUTE M = (45 - D1 - D2 - D3 - D4 - D5 - D6 - D7 - D8 - D9) DISPLAY M END-READ.E.
