PROGRAM-ID. P. DATA DIVISION. WORKING-STORAGE SECTION. 01 F PIC 999 VALUE 3. 01 S PIC 999 VALUE 5. 01 D PIC 9 VALUE 1. 01 B PIC 9. 01 N PIC 999. 01 V PIC 999. PROCEDURE DIVISION. PERFORM VARYING N FROM 5 BY 1 UNTIL N = 201 IF D = 1 AND S - F = 2 DISPLAY F "," S END-IF MOVE 1 TO D PERFORM VARYING V FROM 2 BY 1 UNTIL V = N IF B = 1 CONTINUE END-IF IF FUNCTION MOD (N, V) = 0 MOVE 0 TO D MOVE 1 TO B END-IF END-PERFORM IF D = 1 MOVE S TO F MOVE N TO S END-IF MOVE 0 TO B END-PERFORM STOP RUN.